In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\user\Book1.csv")
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0   NaN
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [2]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False   True
3  False     False  False
4  False     False  False
5  False      True  False
6  False     False  False

# Exploring data

In [3]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0   NaN
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [4]:
df.tail()

        city  humidity  temp
2        vzg      56.0   NaN
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [5]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [6]:
df['humidity']=df['humidity'].fillna(df['humidity'].sum())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [7]:
df.shape

(7, 3)

In [8]:
df.columns

Index(['city', 'humidity', 'temp'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [11]:
df.city

0          Hyd
1          kkd
2          vzg
3          Hyd
4          vzg
5          kkd
6    bangalore
Name: city, dtype: object

In [12]:
df.info

<bound method DataFrame.info of         city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0>

In [13]:
df[2:6]

  city  humidity  temp
2  vzg      56.0  63.0
3  Hyd      23.0  32.0
4  vzg      34.0  89.0
5  kkd     270.0  67.0

# creating a database

In [14]:
data=({
    "Name":["Niha","Kavs","Vinay","Sri","Sai","Sagarika","Raju"],
    "Age": [12,23,45,67,23,23,12]
})
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [15]:
df.tail()

        city  humidity  temp
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [16]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0  63.0
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [17]:
df.shape

(7, 3)

In [18]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [19]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False  False
3  False     False  False
4  False     False  False
5  False     False  False
6  False     False  False

In [21]:
df.info

<bound method DataFrame.info of         city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0>

In [22]:
df[2:6]

  city  humidity  temp
2  vzg      56.0  63.0
3  Hyd      23.0  32.0
4  vzg      34.0  89.0
5  kkd     270.0  67.0

In [23]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      7 non-null      object
 1   humidity  7 non-null      float64
 2   temp      7 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes